/*VERSIONS

0.0.0.04	
-шифр KZ 1
- - все нули 1 (маскировка нулей)
- - порядок байт
- - интуитивная 1 (опрос - ок)
- - версия 64b (логин плюс пароль шифруются совместно)
- -  последовательность (защита от неверной последовательности выполнения алгоритмов расшифровки)
-функции (логин и пароль)
---время команда (00)
---запись лога
---выдача лога
-логин и пароль проверка
-логин и пароль изменение
-логин и пароль сброс
-разлогиниться по времени
-ip access работа без режима (по умолчанию)
-ip access доступ для каждого порта
-подсчет чексуммы прошивки
-переход на 48МГц
